package day006;

public class 정리 {
	public static void main(String[] args) {
		/*
		 * 1. 변수
		 * - 일반변수 (지역변수, 기본형변수) : 값을 저장하는 기본 메모리 공간
		 * - 정수형 : int, byte, short, long(접미사 L(l))
		 * - 실수형 : double, float(접미사 F(f))
		 * - 문자형 : char(1글자, 정수형으로 분류하기도 함, 유니코드)
		 * - 불리언 : boolean(true/false)
		 * - 참조변수 : 객체의 주소를 저장하는 변수(객체명)
		 * - 자료형 변환 : 변수, 상수, 리터럴 값들을 일시적으로 다른 자료형으로 변환
		 * 		- 자동 현변환 : 정수 -> 실수, 작은 바이트 -> 큰 바이트
		 * 		- 명시적 형변환 : 자동으로 형변환이 되지 않는 경우
		 * 
		 * 2. 연산자
		 * - 대입연산자 (=) : 오른쪽에 있는 값을 왼쪽에 저장
		 * 		- 왼쪽에는 반드시 저장 가능한 변수/객체가 있어야함
		 * 		- 왼쪽과 오른쪽의 자료형은 반드시 같아야함
		 * - 산술연산자 (+, -, *, /, %)
		 * 		- 정수 / 정수 = 정수
		 * 		- 0으로 나누면 에러 발생
		 * - 비교연산자 (>=, <=, >, <, ==, !=)
		 * 		- 항상 결과가 true 아니면 false
		 * - 논리연산자 (&&, ||, !)
		 * 		- &&(and) : 모두 참일때 참
		 * 		- ||(or) : 하나만 참이어도 참
		 * 		- !(not) : 현재 값의 반대 (!참 = 거짓)
		 * - 증감연산자 (++, --) : 1씩 증가, 1씩 감소, 위치에 따라 감소되는 순서가 바뀜
		 * - 조건선택연산자(삼항연산자, 조건식 ? true : false)
		 * 
		 * 3. 조건문 : 조건문이 참이면 실행문을 실행
		 * - if : 조건식이 반드시 참 또는 거짓
		 * - switch : 값이 나오는 식, 변수
		 * 		- 반드시 하나의 case가 끝나면 break문을 넣어줘야함
		 * 
		 * 4. 반복문 :
		 * for (초기화; 조건식; 증감식) {}
		 * while (조건식) {}
		 * do {} while (조건식);
		 * 
		 * 5. break/continue\
		 * - break : 반복문을 빠져나가기 위한 구문
		 * - continue : 현재 반복을 pass하고 다음 반복으로
		 * 
		 * 6. 배열 : 동일한 자료형을 가진 데이터를 모아놓은 형태
		 * 자료형[] 배열명 = new 자료형[크기];		// 선언, 객체 생성
		 * 자료형 배열명[] = new 자료형[크기];		// 선언, 객체 생성
		 * 자료형[] 배열명 = {값, 값, 값, ...}	// 선언, 객체 생성, 값 대입
		 * 배열.length
		 * 배열[index] = 값
		 * - 배열의 index는 0부터
		 * 
		 */
	}
}
